espressif/esp-idf/components/soc/esp32c6/register/soc/sdio_slc_struct.h
/** Type of slc0int_clr register
 *  ******* Description ***********
 */
typedef union {
    struct {
        /** slc_frhost_bit0_int_clr : WT; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit0_int_clr:1;
        /** slc_frhost_bit1_int_clr : WT; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit1_int_clr:1;
        /** slc_frhost_bit2_int_clr : WT; bitpos: [2]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit2_int_clr:1;
        /** slc_frhost_bit3_int_clr : WT; bitpos: [3]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit3_int_clr:1;
        /** slc_frhost_bit4_int_clr : WT; bitpos: [4]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit4_int_clr:1;
        /** slc_frhost_bit5_int_clr : WT; bitpos: [5]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit5_int_clr:1;
        /** slc_frhost_bit6_int_clr : WT; bitpos: [6]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit6_int_clr:1;
        /** slc_frhost_bit7_int_clr : WT; bitpos: [7]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit7_int_clr:1;
        /** slc0_rx_start_int_clr : WT; bitpos: [8]; default: 0;
         *  reserved
         */
        uint32_t slc0_rx_start_int_clr:1;
        /** slc0_tx_start_int_clr : WT; bitpos: [9]; default: 0;
         *  reserved
         */
        uint32_t slc0_tx_start_int_clr:1;
        /** slc0_rx_udf_int_clr : WT; bitpos: [10]; default: 0;
         *  reserved
         */
        uint32_t slc0_rx_udf_int_clr:1;
        /** slc0_tx_ovf_int_clr : WT; bitpos: [11]; default: 0;
         *  reserved
         */
        uint32_t slc0_tx_ovf_int_clr:1;
        /** slc0_token0_1to0_int_clr : WT; bitpos: [12]; default: 0;
         *  reserved
         */
        uint32_t slc0_token0_1to0_int_clr:1;
        /** slc0_token1_1to0_int_clr : WT; bitpos: [13]; default: 0;
         *  reserved
         */
        uint32_t slc0_token1_1to0_int_clr:1;
        /** slc0_tx_done_int_clr : WT; bitpos: [14]; default: 0;
         *  reserved
         */
        uint32_t slc0_tx_done_int_clr:1;
        /** slc0_tx_suc_eof_int_clr : WT; bitpos: [15]; default: 0;
         *  reserved
         */
        uint32_t slc0_tx_suc_eof_int_clr:1;
        /** slc0_rx_done_int_clr : WT; bitpos: [16]; default: 0;
         *  reserved
         */
        uint32_t slc0_rx_done_int_clr:1;
        /** slc0_rx_eof_int_clr : WT; bitpos: [17]; default: 0;
         *  reserved
         */
        uint32_t slc0_rx_eof_int_clr:1;
        /** slc0_tohost_int_clr : WT; bitpos: [18]; default: 0;
         *  reserved
         */
        uint32_t slc0_tohost_int_clr:1;
        /** slc0_tx_dscr_err_int_clr : WT; bitpos: [19]; default: 0;
         *  reserved
         */
        uint32_t slc0_tx_dscr_err_int_clr:1;
        /** slc0_rx_dscr_err_int_clr : WT; bitpos: [20]; default: 0;
         *  reserved
         */
        uint32_t slc0_rx_dscr_err_int_clr:1;
        /** slc0_tx_dscr_empty_int_clr : WT; bitpos: [21]; default: 0;
         *  reserved
         */
        uint32_t slc0_tx_dscr_empty_int_clr:1;
        /** slc0_host_rd_ack_int_clr : WT; bitpos: [22]; default: 0;
         *  reserved
         */
        uint32_t slc0_host_rd_ack_int_clr:1;
        /** slc0_wr_retry_done_int_clr : WT; bitpos: [23]; default: 0;
         *  reserved
         */
        uint32_t slc0_wr_retry_done_int_clr:1;
        /** slc0_tx_err_eof_int_clr : WT; bitpos: [24]; default: 0;
         *  reserved
         */
        uint32_t slc0_tx_err_eof_int_clr:1;
        /** cmd_dtc_int_clr : WT; bitpos: [25]; default: 0;
         *  reserved
         */
        uint32_t cmd_dtc_int_clr:1;
        /** slc0_rx_quick_eof_int_clr : WT; bitpos: [26]; default: 0;
         *  reserved
         */
        uint32_t slc0_rx_quick_eof_int_clr:1;
        /** slc0_host_pop_eof_err_int_clr : WT; bitpos: [27]; default: 0;
         *  reserved
         */
        uint32_t slc0_host_pop_eof_err_int_clr:1;
        /** hda_recv_done_int_clr : WT; bitpos: [28]; default: 0;
         *  reserved
         */
        uint32_t hda_recv_done_int_clr:1;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} sdio_slc0int_clr_reg_t;

/** Type of slc1int_raw register
 *  reserved
 */
typedef union {
    struct {
        /** slc_frhost_bit8_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit8_int_raw:1;
        /** slc_frhost_bit9_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit9_int_raw:1;
        /** slc_frhost_bit10_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit10_int_raw:1;
        /** slc_frhost_bit11_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit11_int_raw:1;
        /** slc_frhost_bit12_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit12_int_raw:1;
        /** slc_frhost_bit13_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit13_int_raw:1;
        /** slc_frhost_bit14_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit14_int_raw:1;
        /** slc_frhost_bit15_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit15_int_raw:1;
        /** slc1_rx_start_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  reserved
         */
        uint32_t slc1_rx_start_int_raw:1;
        /** slc1_tx_start_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_start_int_raw:1;
        /** slc1_rx_udf_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  reserved
         */
        uint32_t slc1_rx_udf_int_raw:1;
        /** slc1_tx_ovf_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_ovf_int_raw:1;
        /** slc1_token0_1to0_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  reserved
         */
        uint32_t slc1_token0_1to0_int_raw:1;
        /** slc1_token1_1to0_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  reserved
         */
        uint32_t slc1_token1_1to0_int_raw:1;
        /** slc1_tx_done_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_done_int_raw:1;
        /** slc1_tx_suc_eof_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_suc_eof_int_raw:1;
        /** slc1_rx_done_int_raw : R/WTC/SS; bitpos: [16]; default: 0;
         *  reserved
         */
        uint32_t slc1_rx_done_int_raw:1;
        /** slc1_rx_eof_int_raw : R/WTC/SS; bitpos: [17]; default: 0;
         *  reserved
         */
        uint32_t slc1_rx_eof_int_raw:1;
        /** slc1_tohost_int_raw : R/WTC/SS; bitpos: [18]; default: 0;
         *  reserved
         */
        uint32_t slc1_tohost_int_raw:1;
        /** slc1_tx_dscr_err_int_raw : R/WTC/SS; bitpos: [19]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_dscr_err_int_raw:1;
        /** slc1_rx_dscr_err_int_raw : R/WTC/SS; bitpos: [20]; default: 0;
         *  reserved
         */
        uint32_t slc1_rx_dscr_err_int_raw:1;
        /** slc1_tx_dscr_empty_int_raw : R/WTC/SS; bitpos: [21]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_dscr_empty_int_raw:1;
        /** slc1_host_rd_ack_int_raw : R/WTC/SS; bitpos: [22]; default: 0;
         *  reserved
         */
        uint32_t slc1_host_rd_ack_int_raw:1;
        /** slc1_wr_retry_done_int_raw : R/WTC/SS; bitpos: [23]; default: 0;
         *  reserved
         */
        uint32_t slc1_wr_retry_done_int_raw:1;
        /** slc1_tx_err_eof_int_raw : R/WTC/SS; bitpos: [24]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_err_eof_int_raw:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} sdio_slc1int_raw_reg_t;

/** Type of slc1int_st register
 *  reserved
 */
typedef union {
    struct {
        /** slc_frhost_bit8_int_st : RO; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit8_int_st:1;
        /** slc_frhost_bit9_int_st : RO; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit9_int_st:1;
        /** slc_frhost_bit10_int_st : RO; bitpos: [2]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit10_int_st:1;
        /** slc_frhost_bit11_int_st : RO; bitpos: [3]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit11_int_st:1;
        /** slc_frhost_bit12_int_st : RO; bitpos: [4]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit12_int_st:1;
        /** slc_frhost_bit13_int_st : RO; bitpos: [5]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit13_int_st:1;
        /** slc_frhost_bit14_int_st : RO; bitpos: [6]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit14_int_st:1;
        /** slc_frhost_bit15_int_st : RO; bitpos: [7]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit15_int_st:1;
        /** slc1_rx_start_int_st : RO; bitpos: [8]; default: 0;
         *  reserved
         */
        uint32_t slc1_rx_start_int_st:1;
        /** slc1_tx_start_int_st : RO; bitpos: [9]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_start_int_st:1;
        /** slc1_rx_udf_int_st : RO; bitpos: [10]; default: 0;
         *  reserved
         */
        uint32_t slc1_rx_udf_int_st:1;
        /** slc1_tx_ovf_int_st : RO; bitpos: [11]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_ovf_int_st:1;
        /** slc1_token0_1to0_int_st : RO; bitpos: [12]; default: 0;
         *  reserved
         */
        uint32_t slc1_token0_1to0_int_st:1;
        /** slc1_token1_1to0_int_st : RO; bitpos: [13]; default: 0;
         *  reserved
         */
        uint32_t slc1_token1_1to0_int_st:1;
        /** slc1_tx_done_int_st : RO; bitpos: [14]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_done_int_st:1;
        /** slc1_tx_suc_eof_int_st : RO; bitpos: [15]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_suc_eof_int_st:1;
        /** slc1_rx_done_int_st : RO; bitpos: [16]; default: 0;
         *  reserved
         */
        uint32_t slc1_rx_done_int_st:1;
        /** slc1_rx_eof_int_st : RO; bitpos: [17]; default: 0;
         *  reserved
         */
        uint32_t slc1_rx_eof_int_st:1;
        /** slc1_tohost_int_st : RO; bitpos: [18]; default: 0;
         *  reserved
         */
        uint32_t slc1_tohost_int_st:1;
        /** slc1_tx_dscr_err_int_st : RO; bitpos: [19]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_dscr_err_int_st:1;
        /** slc1_rx_dscr_err_int_st : RO; bitpos: [20]; default: 0;
         *  reserved
         */
        uint32_t slc1_rx_dscr_err_int_st:1;
        /** slc1_tx_dscr_empty_int_st : RO; bitpos: [21]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_dscr_empty_int_st:1;
        /** slc1_host_rd_ack_int_st : RO; bitpos: [22]; default: 0;
         *  reserved
         */
        uint32_t slc1_host_rd_ack_int_st:1;
        /** slc1_wr_retry_done_int_st : RO; bitpos: [23]; default: 0;
         *  reserved
         */
        uint32_t slc1_wr_retry_done_int_st:1;
        /** slc1_tx_err_eof_int_st : RO; bitpos: [24]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_err_eof_int_st:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} sdio_slc1int_st_reg_t;

/** Type of slc1int_ena register
 *  reserved
 */
typedef union {
    struct {
        /** slc_frhost_bit8_int_ena : R/W; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit8_int_ena:1;
        /** slc_frhost_bit9_int_ena : R/W; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit9_int_ena:1;
        /** slc_frhost_bit10_int_ena : R/W; bitpos: [2]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit10_int_ena:1;
        /** slc_frhost_bit11_int_ena : R/W; bitpos: [3]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit11_int_ena:1;
        /** slc_frhost_bit12_int_ena : R/W; bitpos: [4]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit12_int_ena:1;
        /** slc_frhost_bit13_int_ena : R/W; bitpos: [5]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit13_int_ena:1;
        /** slc_frhost_bit14_int_ena : R/W; bitpos: [6]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit14_int_ena:1;
        /** slc_frhost_bit15_int_ena : R/W; bitpos: [7]; default: 0;
         *  reserved
         */
        uint32_t slc_frhost_bit15_int_ena:1;
        /** slc1_rx_start_int_ena : R/W; bitpos: [8]; default: 0;
         *  reserved
         */
        uint32_t slc1_rx_start_int_ena:1;
        /** slc1_tx_start_int_ena : R/W; bitpos: [9]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_start_int_ena:1;
        /** slc1_rx_udf_int_ena : R/W; bitpos: [10]; default: 0;
         *  reserved
         */
        uint32_t slc1_rx_udf_int_ena:1;
        /** slc1_tx_ovf_int_ena : R/W; bitpos: [11]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_ovf_int_ena:1;
        /** slc1_token0_1to0_int_ena : R/W; bitpos: [12]; default: 0;
         *  reserved
         */
        uint32_t slc1_token0_1to0_int_ena:1;
        /** slc1_token1_1to0_int_ena : R/W; bitpos: [13]; default: 0;
         *  reserved
         */
        uint32_t slc1_token1_1to0_int_ena:1;
        /** slc1_tx_done_int_ena : R/W; bitpos: [14]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_done_int_ena:1;
        /** slc1_tx_suc_eof_int_ena : R/W; bitpos: [15]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_suc_eof_int_ena:1;
        /** slc1_rx_done_int_ena : R/W; bitpos: [16]; default: 0;
         *  reserved
         */
        uint32_t slc1_rx_done_int_ena:1;
        /** slc1_rx_eof_int_ena : R/W; bitpos: [17]; default: 0;
         *  reserved
         */
        uint32_t slc1_rx_eof_int_ena:1;
        /** slc1_tohost_int_ena : R/W; bitpos: [18]; default: 0;
         *  reserved
         */
        uint32_t slc1_tohost_int_ena:1;
        /** slc1_tx_dscr_err_int_ena : R/W; bitpos: [19]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_dscr_err_int_ena:1;
        /** slc1_rx_dscr_err_int_ena : R/W; bitpos: [20]; default: 0;
         *  reserved
         */
        uint32_t slc1_rx_dscr_err_int_ena:1;
        /** slc1_tx_dscr_empty_int_ena : R/W; bitpos: [21]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_dscr_empty_int_ena:1;
        /** slc1_host_rd_ack_int_ena : R/W; bitpos: [22]; default: 0;
         *  reserved
         */
        uint32_t slc1_host_rd_ack_int_ena:1;
        /** slc1_wr_retry_done_int_ena : R/W; bitpos: [23]; default: 0;
         *  reserved
         */
        uint32_t slc1_wr_retry_done_int_ena:1;
        /** slc1_tx_err_eof_int_ena : R/W; bitpos: [24]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_err_eof_int_ena:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} sdio_slc1int_ena_reg_t;

